apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_RootHub.cpp
    if (!desc->appendBytes(&intfDesc,  intfDesc.bLength))
        return(kIOReturnNoMemory);

    if (!desc->appendBytes(&endptDesc, endptDesc.bLength))
        return(kIOReturnNoMemory);

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::SetRootHubDescriptor(OSData * /*buffer*/)
{
    USBLog(3,"%s[%p]::SetRootHubDescriptor unimplemented", getName(), this);
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::GetRootHubStatus(IOUSBHubStatus *status)
{
    *(UInt32 *)status = 0;		// The EHCI doesn't have OC or LPS status, nop remote wakeup status

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::SetRootHubFeature(UInt16 wValue)
{
    switch(wValue)
    {
        case kUSBHubLocalPowerChangeFeature :
           USBLog(3,"%s[%p]: unimplemented Set Power Change Feature", getName(), this);
            // EHCIRootHubLPSChange(true);  // not implemented yet
            break;

        case kUSBHubOverCurrentChangeFeature :
            USBLog(3,"%s[%p]: unimplemented Set Overcurrent Change Feature", getName(), this);
            // EHCIRootHubOCChange(true);  // not implemented yet
            break;
            
        default:
            USBLog(3,"%s[%p]: Unknown hub set (%d) in root hub", getName(), this, wValue);
            break;
    }

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::ClearRootHubFeature(UInt16 wValue)
{
    switch(wValue)
    {
        case kUSBHubLocalPowerChangeFeature :
            USBLog(3,"%s[%p]: unimplemented Clear Power Change Feature", getName(), this);
            // EHCIRootHubLPSChange(false);  // not implemented yet
            break;

        case kUSBHubOverCurrentChangeFeature :
            USBLog(3,"%s[%p]: unimplemented Clear Overcurrent Change Feature", getName(), this);
            // EHCIRootHubOCChange(false);  // not implemented yet
            break;

        default:
            USBLog(3,"%s[%p]: Unknown hub clear (%d) in root hub", getName(), this, wValue);
            break;
    }

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::GetRootHubPortStatus(IOUSBHubPortStatus *status, UInt16 port)
{
    static UInt32 	prevStatus[kMaxPorts];
    UInt16		portFlags;
    UInt32		portSC, portSCChange;

   
#if (DEBUGGING_LEVEL > 2)
    IOLog("EHCIUIM -- GetRootHubPortStatus port %d",port);
#endif
    if (port < 1 || port > 15)
        return(kIOReturnBadArgument);  // FIXME change error code

    //adjust port number for array use
    port--;

    portSC = USBToHostLong (_pEHCIRegisters->PortSC[port]);

    
    // translate EHCI's random flag order into same order as hub report (and OHCI reg)
    portFlags = 0;
    if( (portSC & kEHCIPortSC_Connect) != 0)
    {
	    portFlags |= kHubPortConnection;
    }
    if( (portSC & kEHCIPortSC_Enabled) != 0)
    {
	    portFlags |= kHubPortEnabled;
    }
    if( (portSC & kEHCIPortSC_Suspend) != 0)
    {
	    portFlags |= kHubPortSuspend;
    }
    if( (portSC & kEHCIPortSC_OverCurrent) != 0)
    {
	    portFlags |= kHubPortOverCurrent;
    }
    if( (portSC & kEHCIPortSC_Reset) != 0)
    {
	    portFlags |= kHubPortBeingReset;
    }
    if( (portSC & kEHCIPortSC_Power) != 0)
    {
	    portFlags |= kHubPortPower;
    }
    
    // Note: Speed not reported, this is USB 2
    // Not quite, we have to say its a high speed device
    
    portFlags |= kHubPortHighSpeed;
    
    status->statusFlags = HostToUSBWord(portFlags);
    
    // Now do the same for change flags, we need to work some of this out ourselves.
    
    portSCChange = (prevStatus[port] ^ portSC);	// That's Xor, bitwise
    portFlags = 0;

    if( (portSC & kEHCIPortSC_ConnectChange) != 0)
    {
	    portFlags |= kHubPortConnection;
    }

    if( (portSC & kEHCIPortSC_EnableChange) != 0)
    {
	    portFlags |= kHubPortEnabled;
    }
    if( (portSCChange & kEHCIPortSC_Suspend) != 0)
    {
	    changeBits[port] |= kHubPortSuspend;
    }
    if(changeBits[port] & kHubPortSuspend)
    {
	    portFlags |= kHubPortSuspend;
    }
    if( (portSC & kEHCIPortSC_OCChange) != 0)
    {
	    portFlags |= kHubPortOverCurrent;
    }
    
    if( (portSCChange & kEHCIPortSC_Reset) != 0)
    {
	    changeBits[port] |= kHubPortBeingReset;
    }
    if(changeBits[port] & kHubPortBeingReset)
    {
	    portFlags |= kHubPortBeingReset;
    }

    // This bit should not be set for the change bits. Its makes no sense, its confusing the change logic.
//    portFlags |= kHubPortHighSpeed;		// Anything connected to EHCI is always high speed
                                        // If its not high speed, its on the companion

    status->changeFlags = HostToUSBWord(portFlags);

    prevStatus[port] = portSC;

#if (DEBUGGING_LEVEL > 2)
    IOLog(", statusFlags %x, changeFlags %x \n",status->statusFlags, status->changeFlags);
#endif

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::SetRootHubPortFeature(UInt16 wValue, UInt16 wIndex)
{
    IOReturn	err;
    UInt16	port = wIndex;
    
    switch(wValue)
    {
        case kUSBHubPortSuspendFeature :
            err = EHCIRootHubPortSuspend(port, true);
            break;

        case kUSBHubPortResetFeature :
            err = EHCIRootHubResetPort(port);
            break;

        case kUSBHubPortEnableFeature :
            err = EHCIRootHubPortEnable(port, true);
            break;

        case kUSBHubPortPowerFeature :
            err = EHCIRootHubPortPower(port, true);
            err = EHCIRootHubPower(true);
            break;

        default:
            USBLog(3,"%s[%p]::SetRootHubPortFeature unknown wValue %d, wIndex %d", getName(), this, wValue, wIndex);
            err = kIOReturnUnsupported;
            break;
    }

    return err;
}



IOReturn 
AppleUSBEHCI::ClearRootHubPortFeature(UInt16 wValue, UInt16 wIndex)
{
    IOReturn	err;
    UInt16	port = wIndex;

    switch(wValue)
    {
        case kUSBHubPortEnableFeature :
           err = EHCIRootHubPortEnable(port, false);
            break;

        case kUSBHubPortSuspendFeature :
           err = EHCIRootHubPortSuspend(port, false);
            break;

