apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_RootHub.cpp
        case kUSBHubPortPowerFeature :
           err = EHCIRootHubPortPower(port, false);
            // Now need to check if all ports are switched off and
            // gang off if in gang mode
            break;

        // ****** Change features *******
        case kUSBHubPortConnectionChangeFeature :
           err = EHCIRootHubResetChangeConnection(port);
            break;

        case kUSBHubPortEnableChangeFeature :
            err = EHCIRootHubResetEnableChange(port);
            break;

        case kUSBHubPortSuspendChangeFeature :
           err = EHCIRootHubResetSuspendChange(port);
            break;

        case kUSBHubPortOverCurrentChangeFeature :
           err = EHCIRootHubResetOverCurrentChange(port);
            break;

        case kUSBHubPortResetChangeFeature :
           err = EHCIRootHubResetResetChange(port);
            break;

        default:
            USBLog(3,"%s[%p]::ClearRootHubPortFeature unknown wValue %d, wIndex %d", getName(), this, wValue, wIndex);
            err = kIOReturnUnsupported;
            break;
    }
    return err;
}



IOReturn 
AppleUSBEHCI::GetRootHubPortState(UInt8 *state, UInt16 port)
{
    USBLog(3,"%s[%p]::GetRootHubPortState for port %d", getName(), this, port);
    return kIOReturnSuccess;
}


IOReturn 
AppleUSBEHCI::SetHubAddress(UInt16 wValue)
{
    _rootHubFuncAddress = wValue;

    return kIOReturnSuccess;
}



static UInt32 
getPortSCForWriting(EHCIRegistersPtr _pEHCIRegisters, short port)
{
    return USBToHostLong(_pEHCIRegisters->PortSC[port-1]) & 
	    ~(kEHCIPortSC_ConnectChange|kEHCIPortSC_EnableChange|kEHCIPortSC_OCChange);	// Mask out these bits, if set, they clear the condition

}



IOReturn 
AppleUSBEHCI::EHCIRootHubPower(bool on)
{
    on = 0;

    // I don't think this has a power switch
    
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubResetChangeConnection(UInt16 port)
{
    UInt32 value;

    value = getPortSCForWriting(_pEHCIRegisters,port);

    value |= kEHCIPortSC_ConnectChange;					// clear status change

    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    value = getPortSCForWriting(_pEHCIRegisters,port);

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubResetResetChange(UInt16 port)
{
    port--;
    if(port >= kMaxPorts)
    {
        USBLog(3, "%s[%p]::EHCIRootHubResetResetChange Too many ports specified(%d > %d)", getName(), this, port, kMaxPorts);
	return kIOReturnBadArgument;
    }
    
    changeBits[port] &= ~kHubPortBeingReset;
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubResetSuspendChange(UInt16 port)
{
    port--;
    if(port >= kMaxPorts)
    {
        USBLog(3, "%s[%p]::EHCIRootHubResetSuspendChange Too many ports specified(%d > %d)", getName(), this, port, kMaxPorts);
        return kIOReturnBadArgument;
    }
    
    changeBits[port] &= ~kHubPortSuspend;
    IOSync();

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubResetEnableChange(UInt16 port)
{
    UInt32 value;

    value = getPortSCForWriting(_pEHCIRegisters,port);

    value |= kEHCIPortSC_EnableChange;			// clear status change

    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    return kIOReturnSuccess;
}

    

IOReturn 
AppleUSBEHCI::EHCIRootHubResetOverCurrentChange(UInt16 port)
{
    UInt32 value;

    value = getPortSCForWriting(_pEHCIRegisters,port);

    value |= kEHCIPortSC_OCChange;/* clear status change */

    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    return kIOReturnSuccess;
}



void 
AppleUSBEHCI::waitForSOF(EHCIRegistersPtr pEHCIRegisters)
{
    IOSleep(1);
}



IOReturn 
AppleUSBEHCI::EHCIRootHubResetPort (UInt16 port)
{
    UInt32 		value;
    UInt32		count, portSC;


    USBLog(5, "%s[%p]::EHCIRootHubResetPort begin", getName(), this);

    value = getPortSCForWriting(_pEHCIRegisters, port);
    
    if( (value & (kEHCIPortSC_Connect | kEHCIPortSC_Power)) != (kEHCIPortSC_Connect | kEHCIPortSC_Power) )
    {
	// Can only enter the resetting state if the device is connected and the power is on.
	// Having probelms with reset happening to powered off device, reset change is on 
	// when next device is connected. That consfuses hub logic which skips the reset
	// state. So no device is enumerated if that happens.
	// This is all because EHCI is so miserly, they can't have a proper reset state machine like OHCI.
	USBLog(1, "%s[%p]::EHCIRootHubResetPort - Not resetting port, beacuse device is unplugged of powered off (%x).", getName(), this, value);
	return kIOReturnNotResponding;	
    }

    if( ((value & kEHCIPortSC_LineSt) >> kEHCIPortSC_LineStPhase) == kEHCILine_Low)
    {
	USBLog(4, "%s[%p]::EHCIRootHubResetPort - low speed device, releasing port %d", getName(), this, port);
	value |= kEHCIPortSC_Owner;
	_pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
	IOSync();
	changeBits[port-1] |= kHubPortBeingReset;		// Make a reset change bit change
    
        // Pretend the port doesn't exist.
	return kIOReturnNotResponding;
    }
	
    value |= kEHCIPortSC_Reset;
    value &= ~kEHCIPortSC_Enabled;
    
    // Set the reset on
    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    // Note:  Section 7.1.7.5 of the USB Spec requires a 50ms reset for RootHub ports, not 10, as we had done prior to Feb 2004.  However, in
	// testing the 10.3.6 update, (SUPanNavy), the following 2 bugs were traced to this pulse being 50ms:
	// <rdar://problem/3829981> 7R13: Suntac Slipper X does not work correctly on Navy
    // <rdar://problem/3841991> SUPanNavy7R20 with USBCDC3.0.1GMc2: iSync hangs while trying to connect to V710.
	//
	// Because we have no record of any devices failing when we had the 10ms reset pulse, we are changing it back to 10ms, even tho' it violates
	// the spec.  We certainly hope not to have to revisit this, but we might.  
	//
    IOSleep(10);
    
    value = getPortSCForWriting(_pEHCIRegisters, port);
    value &= ~kEHCIPortSC_Reset;

