apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_RootHub.cpp
    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    // sleep for 3ms instead of 2ms, just to give the chip a little more margin
    IOSleep(2);
    
    count = 0;
    do {
	IOSleep(1);
	portSC = USBToHostLong(_pEHCIRegisters->PortSC[port-1]);
    } while( ((portSC & kEHCIPortSC_Reset) != 0) && (count++ < 2001) );

    USBLog(5, "%s[%p]::EHCIRootHubResetPort reset took extra %d", getName(), this, count);

    IOSleep(1);
    
    if ( portSC != USBToHostLong(_pEHCIRegisters->PortSC[port-1]) )
    {
        USBLog(1, "%s[%p]::EHCIRootHubResetPort-  portSC is not equal to value of register! (%p)(%p)", getName(), this, portSC, USBToHostLong(_pEHCIRegisters->PortSC[port-1]));
	// use the updated value instead of the cached one
	portSC = USBToHostLong(_pEHCIRegisters->PortSC[port-1]);
    }

    if( ((portSC & kEHCIPortSC_Reset) != 0) || (count >= 2000) )
    {
	USBLog(4, "%s[%p]::EHCIRootHubResetPort-  port slow to come out of reset %d", getName(), this, count);
    }

    if( (portSC & (kEHCIPortSC_Connect | kEHCIPortSC_Power)) != (kEHCIPortSC_Connect | kEHCIPortSC_Power) )
    {
	// Have been disconnected or powered off, pretend reset never happened.
	
	USBLog(1, "%s[%p]::EHCIRootHubResetPort - Not resetting port 2, beacuse device is unplugged of powered off (%x).", getName(), this, portSC);
	return kIOReturnNotResponding;	
    }

    USBLog(5, "%s[%p]::EHCIRootHubResetPort - Setting port reset change bit.", getName(), this, value);
    changeBits[port-1] |= kHubPortBeingReset;

    if( (portSC & kEHCIPortSC_Enabled) == 0)
    {
	USBLog(5, "%s[%p]::EHCIRootHubResetPort-  full speed device (no enable) releasing device %x", getName(), this, portSC);
	value = getPortSCForWriting(_pEHCIRegisters, port);
	value |= kEHCIPortSC_Owner;
	_pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
	IOSync();
        
        // Pretend the port doesn't exist.
	return kIOReturnNotResponding;
    }
    else
    {
	waitForSOF(_pEHCIRegisters);
	IOSleep(1);
	portSC = USBToHostLong(_pEHCIRegisters->PortSC[port-1]);
	if( (portSC & kEHCIPortSC_Enabled) == 0)
	{
	    USBLog(3, "%s[%p]::EHCIRootHubResetPort *********** Port disabled after 1 frame******* %x", getName(), this, portSC);
	}
    }

    USBLog(5, "%s[%p]::EHCIRootHubResetPort done", getName(), this);
    
    // Make the status change interrupt happen, of Reset will hang waiting for it
    // I think this is safe as the root hub runs outside the lock.
   
    USBLog(5, "%s[%p]::EHCIRootHubResetPort - Call UIMRootHubStatusChange",  getName(), this);
 
    UIMRootHubStatusChange();
    
    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubPortEnable(UInt16 port, bool enable)
{
    UInt32 		value;

    USBLog(3,"%s[%p]::EHCIRootHubPortEnable port: %d, on: %d", getName(), this, port, enable);

    if (enable)
    {
        USBLog(1,"%s[%p]::EHCIRootHubPortEnable enabling port illegal.", getName(), this);
        return kIOReturnUnsupported;
    }

    value = getPortSCForWriting(_pEHCIRegisters, port);
    value &= ~kEHCIPortSC_Enabled; /* disable port */
    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubPortSuspend(UInt16 port, bool suspend)
{
    UInt32 		value;
    UInt32		count;
    
    USBLog(3,"%s[%p]::EHCIRootHubPortSuspend port: %d, on: %d", getName(), this, port, suspend);

    value = getPortSCForWriting(_pEHCIRegisters, port);
    
    if (suspend)
        value |= kEHCIPortSC_Suspend;  /* suspend port */
    else
        value |= kEHCIPortSC_Resume; /* resume port */

    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong(value);
    IOSync();
    
    if (!suspend)
    {
	// EHCI is again lame and we have to turn the bit off ourselves again.
        IOSleep(20);
        
        value = getPortSCForWriting(_pEHCIRegisters, port);
        value &= ~kEHCIPortSC_Resume; /* resume port */
	_pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
        IOSync();
	changeBits[port-1] |= kHubPortBeingReset;
	UIMRootHubStatusChange();
    }

    return kIOReturnSuccess;
}



IOReturn 
AppleUSBEHCI::EHCIRootHubPortPower(UInt16 port, bool on)
{
    UInt32 	value= 0;

    value = getPortSCForWriting(_pEHCIRegisters, port);
    
    if(on)
    {
	// we need to power on EHCI in two steps. The connect/disconnect bits latch to 0 if Port Power is off
	// and they don't seem to be able to be set simultaneously. So first set the PP, then connect and disconnect
	value |= kEHCIPortSC_Power;								// enable port power
	_pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
        IOSync();
	value |= kEHCIPortSC_WKCNNT_E | kEHCIPortSC_WKDSCNNT_E;					// enable connect/disconnect
    }
    else
    {
	value &= ~kEHCIPortSC_Power;		// disable port power
    }

    _pEHCIRegisters->PortSC[port-1] = HostToUSBLong (value);
    IOSync();

    return kIOReturnSuccess;
}

/*
 * UIMRootHubStatusChange
 *
 * This method gets called when there is a change in the root hub status
 * or a change in the status of one of the ports.  It is assumed that the
 * interrupt will be cleared for us, but we don't clear the change
 * condition, we will get another interrupt.  So turn off the interrupt.
 * Entering this function means that someone turned on the RHSC interrupt
 * and that there is a client waiting in the queue.  The client expects a
 * status change bitmap.
 * To fix: currently there can only be one client in the queue.  The RHSC
 * interrupt should only be turned off if there is no one else in the queue,
 * or, all clients should be responded to with the one interrupt.
 */
void 
AppleUSBEHCI::UIMRootHubStatusChange(void)
{
    UIMRootHubStatusChange(false);
}



OSMetaClassDefineReservedUsed(IOUSBController,  10);
void AppleUSBEHCI::UIMRootHubStatusChange(bool abort)
{
    UInt8		numPorts = 0;
    UInt32 		HCSParams;
    UInt16 		statusChangedBitmap;   /* only have 15 ports in EHCI */
    IOUSBHubPortStatus  portStatus;
    UInt32 		hubStatus, statusBit, tempStatus;
    unsigned int      	index, port, move;
    struct InterruptTransaction last;
    

